{"topic":{"0":0,"1":1,"2":2,"3":3,"4":4,"5":5,"6":6,"7":7,"8":8,"9":9,"10":10,"11":11,"12":12,"13":13,"14":14},"Summary":{"0":"major relief to Pakistan's ailing former Prime Minister Nawaz Sharif, a court on Saturday allowed him to travel abroad for four weeks and ordered the Imran Khan government to remove his name from the Exit Control List without any conditions.'Change old mindset', Imran Khan to Pakistani bureaucrats https:\/\/t.co\/5PwsyYPoba via @timesofindia @TimesNow @TimesNowHindi @WIONews @ndtv @republic @IndiaToday @PTI_News @WSJ @FoxNews @NewYorker @nytimes @BBCWorld @PTI_News @cnni.Terrorist fire raided FC post in North Wazirstan Distt near Pak-Afg Border.imran khan nay sari pti ko nashay par laga dia hay https:\/\/t.co\/FxgSMAklYY.Meanwhile, cabinet under PM Imran khan decides not to discuss this issue and no Pakistani news channel at prime time 9PM aired the news r named Malik Riaz #media.","1":"Like Shabaz did under Nawaz's regimes  campaign: PM Imran Khan lauds resilience of workers https:\/\/t.co\/P1nIUlsACF.PM Imran Khan meets Wajid Zia, the former Panama JIT head who will now head FIA.https:\/\/t.co\/mLYKA6qcZv. PM Imran Khan meets Wajid Zia, the former Panama JIT head who will now head FIA.@kalsoomzeb @munawarshaikh92 kider he  kutta imran khan or us ka bajwa gandu..Sohail Tanvir &amp; Khurram Manzoor (Desert Riders) https:\/\/t.co\/8ZlTBGzCFd. To the Honorable PM of Pakistan Imran Khan............Your indefatigable energy disguised as enthusiasm creates multiple opportunities.","2":"Imran Khan is more concern about Indian Muslim ,Modi is more concern about Pakistani Hindu ,but both aren't concern about their own people, who are suffering with poverty, job losses, Inflation,sinking economic,discrimination ,lawlessness.Both are misleading.@majorgauravarya @ImranKhanPTI I would suggest sir imran khan to pass same bill...Didnt u see sobbing speech of imran khan in un nation formsImran Nasir-Ahmad Khan, the 1st Ahmadi Muslim elected Member of Parliament &amp; will take his seat in the House of Commons.MP Khan joins Lord Tariq Ahmad, the other Ahmadi Muslim, who sits in the  House of Lords.","3":"MusharrafImran Khan tolds the story of Army Chief General Qamar Javed Bajwa's extension,And he accused Musharraf of serious treason,Bajwa \/Imran KhanPakistan Army Chief General Bajwa given six months conditional extension by the ...","4":"Pakistan prime minister Imran Khan claims trees produce oxygen at night, gets trolled on social media https:\/\/t.co\/Dnj7TL6AtY https:\/\/t.co\/BPWEDiMuZU.Deputy Foreign Minister of Malaysia H.E. Dato Marzuki Bin Haji Yaha calls on Prime Minister Imran Khan.But Insha Allah Pakistan will prosper under Imran Khan.@misbahsaboohi @Jemima_Khan @Twitter imran khan never attacks anyone's personal choices, how does he encourage anyone to go out and falsely accuse people of things related to adultery?.The massive bureaucratic reshuffle in Punjab, ordered directly by Prime Minister Imran Khan, brings back Shahbaz Sharif team of go-getters but in the process totally defeats and erodes the PTI’s own corruption narrative against the former chief minister.","5":"@AMShahidLatif What about calling him the son of Hafeez Ullah Niazi who daily bashes Imran Khan on prime time TV?Is he nephew of imran Khan or son of hafeez ullah niazi https:\/\/t.co\/pszTIpjPZn. Most admired men in the worldTwo greats Mick Jagger and Imran Khan enjoying a day of test match cricket https:\/\/t.co\/9hvbmPn3Yh https:\/\/t.co\/9S9xL8yPaw.**A Big Game Between Imran Khan And The Rest** Sach Ki Talash Waqar Malik https:\/\/t.co\/qXD9Emk4kV via @YouTube.Imran khan after a huge crises | Details by Siddique Jan https:\/\/t.co\/3AjY4mQawt via @YouTube.","6":"https:\/\/t.co\/Q2wqxbF7Kt. Pakistan’s Prime Minister Imran Khan has just become the top fifth most influential world leader of 2019 according to a report published by Twiplomacy.Prime Minister Imran Khan accuses opposition of spreading anarchy https:\/\/t.co\/XG4Gy0sUJ7 https:\/\/t.co\/AQ0QbUWJXp. Imran Khan has become the fifth most followed world leader on Twitter, leaving PM Modi way behind in the rankings.Tania Aidrus, the former Google executive  is leading Prime Minister Imran Khan’s Digital Pakistan initiative https:\/\/t.co\/a6N1k2rQwu. Prime Minister Imran Khan accuses opposition of spreading anarchy https:\/\/t.co\/qmJ874eo9M https:\/\/t.co\/cjasvNbzX9.Prime Minister Imran Khan has warned the world regarding the severe consequences of the Hindu supremacist agenda of Indian premier Narendra Modi that is threatening massive bloodshed and war.Tania Aidrus, the former Google executive  is leading Prime Minister Imran Khan’s Digital Pakistan initiative https:\/\/t.co\/a6N1k2rQwu. The journey of Pakistan, turning into a welfare state under the leadership of Prime Minister Imran Khan continues :: 5 shelter homes have been established under #Ehsaas program in #Peshawar by KP Government https:\/\/t.co\/2Lx4ZhRm6w.","7":"So when Hassan Niazi stood up with Khadija, he was Imran Khan's nephew..And when he took part in the riots, he's Hafeez Ullah niazis son and related to pmln?@MumtazObaid The whole world knows Hassan Niazi's father is greatest enemy of Imran Khan.He is Son of PMLN Leader Hafeez Ullah Niazi, not the nephew of Imran Khan.PTI aur Pakistani Awam ko Aik Aur Dhachka | Imran Khan Bhi Nakaami Ki Dehleez Per","8":"Pak Leaders k Siasi Jahaz Tabah Hone Walay Hain | Imran Khan, Nawaz Shareef, Asif Zardari@ImranKhanPTI Imran Khan should play cricket in his drawing room!!.Despite the fact that Pakistan leader, famed Cricketer, Imran Khan is in power, No 1st World Cricket team will play there.@khurramkibaat @UsmanAKBuzdar @ImranKhanPTI Imran Khan needs to listen to Haqeeqat Tv. Most of his MP’s are traitors and they are making life hard for him and for 🇵🇰 https:\/\/t.co\/5w4C37v2IG.@NCA_UK Pakistans tax payers money looted by Nawaz Sharif sells it to Malik Riaz just before Panama leaks and Imran Khan brings it home ","9":"Imran khan sab apke power khatam ho jaiyega ager ap shrik avoid nahi kiya to apke bareme #MuhammadQasim dreams dekha tha, jaisa dekha waise hi hua to apko shrik avoid kor na hoga.@iJainPratik @ImranKhanPTI imran khan bulate h,to bhi hum nhi jaye ge kyu ki india hi mera vatan h,yahi  janme h aur yhi marna h...@KamalMustafaPak @bangalore_ravi Teri bhi cars &amp; buffaloes bech di kya Imran Khan ne , Like he did with his ones......Given the growing need for the Internet, Imran Khan uses it to serve the public its a good decision.https:\/\/t.co\/klKVbXe4Rf. Police reach Imran Khan's nephew Hassaan Niazi's house to arrest him.","10":"But this is Pakistan &amp; PM is Imran Khan...Shame on whole judicial system, judges,and imran khan and usman buzdar..in other words...in sab py baishumar lanathttps:\/\/t.co\/JoAnNjZImc. If Pakistan wants India’s Citizenship Bill to fail, it should change the way it treats its own religious minorities.#StudentsUnion #JamiatPK https:\/\/t.co\/ZTwyFdEGLo. Well,things that lot of Indian journalists running fake propaganda can learn from @nailainayat-her understanding of #CABBill2019 is way better than tht of many Indian journos-integrity is what matters in journalism.Prime Minister Imran Khan  described the project digital Pakistan as one that would unleash the full potential of women and young people in the economy.","11":"#EmergingDigitalPakistan https:\/\/t.co\/XM8hc45VTh. We welcome and appreciate this generous decision of Prime Minister Imran Khan and S.Z.A.Bokhari and extend our fullest cooperation.OWWA https:\/\/t.co\/54tFTgPlmF https:\/\/t.co\/pMdSEoeU1p.#pakistan https:\/\/t.co\/YcboIBQhLp. Minister for Industry &amp; Trade of Russia H.E Mr. Denis V Manturov along with delegation called on Prime Minister Imran Khan in Islamabad.Director General Central &amp; West Asia, Asian Development Bank Mr. Werner Liepach called on Prime Minister Imran Khan in Islamabad Prime Minister Imran Khan will be Chief Guest at the Launching Ceremony of Nationwide Polio Eradication Campaign being held in Islamabad today.-Prime Minister Imran Khan https:\/\/t.co\/fjCpWQpo1e.","12":"@ImranKhanPTI https:\/\/t.co\/fK2bm5dHqz. India...Pakistan...Bangladesh...Burma...Myanmar...Sri Lanka...Bhutan...Nepal...Maldives...Afghanistan...New Delhi...Islamabad...Dhaka...Naypyidaw...Yangon...Colombo...Thimphu...Kathmandu...Male...Kabul...Taliban...Narendra Modi...Imran Khan....He’s critically ill &amp; deserves fairness but not getting it - @HamidMirPAK  https:\/\/t.co\/Sk3r3uPjxe.India...Pakistan...Bangladesh...Burma...Myanmar...Sri Lanka...Bhutan...Nepal...Maldives...Afghanistan...New Delhi...Islamabad...Dhaka...Naypyidaw...Yangon...Colombo...Thimphu...Kathmandu...Male...Kabul...Taliban...Narendra Modi...Imran Khan....Maulana Ka Dharna }Adare Saath Chhood}&gt; Minus One Imran Khan","13":"#DunyaUpdates #DunyaNews #DunyaVideos https:\/\/t.co\/tQNPcxIVJm. Prime Minister Imran Khan appreciated Fayyazul Hassan Chohan’s courage for expressing restraint over lawyers’ vicious attack over the Punjab Institute of Cardiology (PIC)PM Imran Khan's nephew Hassan Khan Niazi here seen vandalising a police car, as lawyers attacked a hospital in Lahore.After all he only said that in Pakistan there's one law for the powerful &amp; another for the weak https:\/\/t.co\/UFFSBANOL5.Prime Minister Imran Khan said that the present Government has focused its energies for the uplift of the poor segments of the population, particularly in the low cost housing sector.PM Imran Khan’s Nephew Involved In Lahore PIC Attack?","14":"Do u want Imran Khan and Bajwa to come back too?https:\/\/t.co\/tAptCLY9Xj. PM Imran Khan should immediately expel Barrister Hassan Khan Niazi, for his rogue actions at Punjab Institute of Cardiology, &amp; let Police deal with him the way an arsonist deserves @ImranKhanPTI.@ImranKhanPTI How many Rohingya refugees has Imran Khan admitted into Pakistan?.Pakistan's PM Imran Khan has criticised CAN 2019 Bill.and pass a bill to protect Muslims who feel threatened in India, Bangladesh and Afghanistan to escape and come to Pakistan to get Citizenship.."}}