[{"topic": 0, "Summary": "Live Stream: President of Turkey Recep Tayyip Erdogan Arrives at Pakistan on the invitation of Prime Minister of Pakistan Imran Khan (13.02.20) . Glorifying muslim Heroes and Islamic history , Prime Minister Imran Khan has directed PTV to air ErtugrulPrime Minister Imran Khan meets President of Turkey Recep Tayyip Erdogan on the sidelines of First Global Refugee Forum in UN Geneva.", "Sentiment": "#b3b3b3", "Date": "2020-03-01"}, {"topic": 1, "Summary": "Imran Khan not attending KL Summit 2019 . Pakistan fully supports Afghan peace process: PM Imran Khan. . Foreign players of Peshawar Zalmi Hashim Amla &amp; Daren Sammy, along with Javed Afridi &amp; Muhammad Akram call on PM Imran Khan Link: .", "Sentiment": "#b3b3b3", "Date": "2019-12-17"}, {"topic": 2, "Summary": "Presiden Turki, Recep Tayyip Erdogan; Emir Qatar Shaikh Amir Al Hamad Al Thamrin; Perdana Menteri Pakistan, Imran Khan.. Do Miya Imran Khan Niazi and have the same Content Writer ?1987 :: Imran Khan and Sunil Gavaskar In Thums Up Advertisement .", "Sentiment": "#b3b3b3", "Date": "2020-02-29"}, {"topic": 3, "Summary": "Chairman Peshawar Zalmi Javed Afridi with captain Daren Sammy and batting mentor Hashim Amla met Prime Minister Imran Khan today at PM House. . PM Imran Khan met Zalmi chairman Captain Coach Muhammad Akram &amp; Batting Mentor in PM secretariat todayMeeting of Javed Afridi and Darren Sammy with PM Imran Khan in Islamabad.", "Sentiment": "#8caa0b", "Date": "2019-12-14"}, {"topic": 4, "Summary": "Fb. .Darren Sammy and Javed Afridi meets with PM Imran Khan in Islamabad. . .", "Sentiment": "#b3b3b3", "Date": "2019-12-23"}, {"topic": 5, "Summary": "Prime Minister Imran Khan visiting hospitals on Minister Imran Khan in Madina Munawwara .", "Sentiment": "#b3b3b3", "Date": "2019-12-08"}, {"topic": 6, "Summary": "Foreign players of Peshawar Zalmi, Hashim Amla and Darren Sammy, along with Javed Afridi and Muhammad Akram called on Prime Minister Imran Khan at Islamabad. . Foreign players of Peshawar Zalmi, Hashim Amla and Darren Sammy, along with Javed Afridi and Muhammad Akram called on Prime Minister Imran Khan at Islamabad. . Foreign players of Peshawar Zalmi, Hashim Amla and Darren Sammy, along with Javed Afridi and Muhammad Akram called on Prime Minister Imran Khan at Islamabad.", "Sentiment": "#8caa0b", "Date": "2019-12-01"}, {"topic": 7, "Summary": "Prime Minister Imran Khan in first year on Economic front: . President of Turkey Recep Tayyip Erdogan Arrives at Pakistan on the invitation of Prime Minister of Pakistan Imran Khan (13.02.20)Prime Minister Imran Khan hosted Sir Vivian Richards, Greg Chappell and Shane Watson at Prime Ministers House on Wednesday .", "Sentiment": "#b3b3b3", "Date": "2020-02-28"}, {"topic": 8, "Summary": "'Puppet regime of political orphans crumbling': Bilawal Bhutto targets Imran Khan-led govt . Samaa News: Prime Minister Imran Khan Meeting with Peshawar Zalmi Chairman Javed Afridi, Captain Daren Sammy, Head coach M Akram &amp; Batting Mentor Hashim Amla.Peshawar Zalmi Owner Javed Afridi, Skipper Darren Sammy, and Batting Mentor Hashim Amla met with Prime Minister Imran Khan in Islamabad!Meeting of javed Afridi and Darren Sammy with PM Imran Khan in Islamabad.", "Sentiment": "#8caa0b", "Date": "2019-12-03"}, {"topic": 9, "Summary": "PM Imran Khan had meetup with Javed Afridi, Daren Sammy, M Akram, Hashim Amla.PM Imran Khan meets Darren Sammy, Hashim Amla and Javed Afridi", "Sentiment": "#b3b3b3", "Date": "2020-01-02"}]